Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar
The Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar class provides the functionality for creating a contextual toolbar.

Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.#ctor(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar class.
controlsGroup: The controls group.

Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.ControlsGroup
Gets the controls group.

Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateButton(System.String,System.Drawing.Image)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateCheckBox(System.String,System.Drawing.Image)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateDropDown


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateDropDown(System.Collections.Generic.IEnumerable{System.Object})


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateDropDown(System.Collections.Generic.IEnumerable{System.Object},System.Object)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateRadioButton(System.String,System.Drawing.Image,System.String)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateTextBox(System.String,System.Drawing.Image)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateValueTextBox(System.Nullable{System.Double})


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateDistanceValueTextBox(System.Nullable{System.Double})


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateAngleValueTextBox(System.Nullable{System.Double})


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.CreateLabel(System.String,System.Drawing.Image)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.Remove(Tekla.Structures.Plugins.DirectManipulation.Core.ControlBase)


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.Show
Shows the contextual toolbar.

Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.Hide
Hide the controls group if currently visible.

Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.Dispose


Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.Add``1(``0)
Adds control to the Tekla.Structures.Plugins.DirectManipulation.Internal.ContextualToolbar.ControlsGroup.
The type of the control.
control: The control.
Returns: The added control.